# ShowEditTileDialog

## Description
Displays the edit tile dialog for the specified tile allowing the user to specify whether they wish to edit the tile's geometry or settings.

```pascal
PROCEDURE ShowEditTileDialog(tileHandle : HANDLE);
```

```python

def vs.ShowEditTileDialog(tileHandle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileHandle|HANDLE|The tile for which the dialog should be displayed.|

## Examples
```pascal
ShowEditTileDialog(tileHandle);
```

## See Also
VS Functions:
CreateTile| ShowEditTileDialog| ShowEditTileSettingsDialog| ShowNewTileDialog| GetTileGeometryGroup| BeginGroupN| AddTileGeometryObject| GetTileGroupParent| IsTileGroupContainedObject| GetTileBackgroundColor| SetTileBackgroundColor| GetTileRepetitionPoint| SetTileRepetitionPoint| GetTileOffsetPoint| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011
## Category
* Dialogs - Modern